duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
		case DL_DATA_STR:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;

			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
			#if defined(CONFIG_PPG_SUPPORT)
				if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
					dl_ppg_start();
				else
			#endif		
				{
					dl_reboot_confirm();
				}
				break;
			}
			break;	
			
		case DL_DATA_PPG:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;

			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
				dl_reboot_confirm();
				break;
			}
			break;
		}
	}
#endif
#ifdef CONFIG_SYNC_SUPPORT
	else if(screen_id == SCREEN_ID_SYNC)
	{
		MenuStartSync();
	}
#endif
#ifdef CONFIG_TEMP_SUPPORT
	else if(screen_id == SCREEN_ID_TEMP)
	{
		if(get_temp_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartTemp();
		}
	}
#endif
	else if(screen_id == SCREEN_ID_SETTINGS)
	{
		ExitSettingsScreen();
	}
	else if(screen_id == SCREEN_ID_POWEROFF)
	{
		EntryIdleScr();
	}
}

#ifdef CONFIG_BLE_SUPPORT
void IdleShowBleStatus(void)
{
	uint16_t x,y,w,h;
	uint16_t ble_link_str[] = {0x0042,0x004C,0x0045,0x0000};//BLE

	LCD_SetFontSize(FONT_SIZE_28);

	if(g_ble_connected)
	{
		LCD_MeasureUniString(ble_link_str, &w, &h);
		LCD_ShowUniString(IDLE_BLE_X+(IDLE_BLE_W-w)/2, IDLE_BLE_Y+(IDLE_BLE_H-w)/2, ble_link_str);
	}
	else
	{
		LCD_FillColor(IDLE_BLE_X, IDLE_BLE_Y, IDLE_BLE_W, IDLE_BLE_H, BLACK);
	}
}
#endif

void IdleShowSystemDate(void)
{
	uint16_t x,y,w,h,str_w,str_h;;
	uint8_t str_date[20] = {0};
	uint16_t str_mon[12] = {
								STR_ID_MONTH_JAN,
								STR_ID_MONTH_FEB,
								STR_ID_MONTH_MAR,
								STR_ID_MONTH_APR,
								STR_ID_MONTH_MAY,
								STR_ID_MONTH_JUN,
								STR_ID_MONTH_JUL,
								STR_ID_MONTH_AUG,
								STR_ID_MONTH_SEPT,
								STR_ID_MONTH_OCT,
								STR_ID_MONTH_NOV,
								STR_ID_MONTH_DEC,
							};

	uint16_t str_mon_cn[2] = {0x6708,0x0000};
	uint16_t str_day_cn[2] = {0x65E5,0x0000};
	uint16_t str_mon_kr[2] = {0xC6D4,0x0000};//?
	uint16_t str_day_kr[2] = {0xC77C,0x0000};//?
	uint16_t *str_m,*str_d;
	uint32_t img_24_num[10] = {IMG_ID_FONT_24_NUM_0,IMG_ID_FONT_24_NUM_1,IMG_ID_FONT_24_NUM_2,IMG_ID_FONT_24_NUM_3,IMG_ID_FONT_24_NUM_4,
							   IMG_ID_FONT_24_NUM_5,IMG_ID_FONT_24_NUM_6,IMG_ID_FONT_24_NUM_7,IMG_ID_FONT_24_NUM_8,IMG_ID_FONT_24_NUM_9};
	uint32_t img_45_num[10] = {IMG_ID_FONT_45_NUM_0,IMG_ID_FONT_45_NUM_1,IMG_ID_FONT_45_NUM_2,IMG_ID_FONT_45_NUM_3,IMG_ID_FONT_45_NUM_4,
							   IMG_ID_FONT_45_NUM_5,IMG_ID_FONT_45_NUM_6,IMG_ID_FONT_45_NUM_7,IMG_ID_FONT_45_NUM_8,IMG_ID_FONT_45_NUM_9};

	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

	LCD_SetFontSize(FONT_SIZE_52);

	switch(global_settings.language)
	{
 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)||defined(LANGUAGE_KR_ENABLE)
   #ifdef LANGUAGE_CN_ENABLE
	case LANGUAGE_CN:
   #endif
   #ifdef LANGUAGE_JA_ENABLE
	case LANGUAGE_JA:
   #endif
   #ifdef LANGUAGE_KR_ENABLE
	case LANGUAGE_KR:
   #endif
		switch(global_settings.language)
		{
	   #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JA_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
		case LANGUAGE_CN:
	   #endif
	   #ifdef LANGUAGE_JA_ENABLE
		case LANGUAGE_JA:
	   #endif
			x = IDLE_DATE_MON_CN_X;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_cn;
			str_d = str_day_cn;
			break;
	   #endif
	   	   
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
			x = IDLE_DATE_MON_CN_X-10;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W+10;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_kr;
			str_d = str_day_kr;
			break;
	   #endif
		}
		
		LCD_FillColor(x, y, w, h, BLACK);
		if(date_time.month > 9)
		{
			LCD_ShowImage(x, y+2, img_24_num[date_time.month/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImage(x, y+2, img_24_num[date_time.month%10]);

		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_m);
		LCD_MeasureUniString(str_m, &w, &h);
		
		x += w;
		if(date_time.day > 9)
		{
			LCD_ShowImage(x, y+2, img_24_num[date_time.day/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImage(x, y+2, img_24_num[date_time.day%10]);
		
		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_d);
		break;
 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JA_ENABLE||LANGUAGE_KR_ENABLE*/		
	
	default:
		x = IDLE_DATE_DAY_EN_X;
		LCD_ShowImage(x+0*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y, img_45_num[date_time.day/10]);
		LCD_ShowImage(x+1*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y, img_45_num[date_time.day%10]);

		LCD_MeasureUniStr(str_mon[date_time.month-1], &str_w, &str_h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
		{
			switch(global_settings.language)
			{
		   #ifdef LANGUAGE_AR_ENABLE
			case LANGUAGE_AR:
				x = IDLE_WEEK_EN_X;
				y = IDLE_WEEK_EN_Y;
				w = IDLE_DATE_MON_EN_W;
				h = IDLE_DATE_MON_EN_H;
				break;
		   #endif
		   
			default:
				x = IDLE_DATE_MON_EN_X;
				y = IDLE_DATE_MON_EN_Y;
				w = IDLE_DATE_MON_EN_W;
				h = IDLE_DATE_MON_EN_H;
				break;
			}
			LCD_FillColor(x, y, w, h, BLACK);
			
			if(w > str_w)
				LCD_ShowUniStrRtoL(x+(w+str_w)/2, y, str_mon[date_time.month-1]);
			else
				LCD_ShowUniStrRtoL(x+w, y, str_mon[date_time.month-1]);
		}
		else
	#endif		
		{
			LCD_FillColor(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, IDLE_DATE_MON_EN_W, IDLE_DATE_MON_EN_H, BLACK);
			
			if(IDLE_DATE_MON_EN_W > str_w)
				LCD_ShowUniStr(IDLE_DATE_MON_EN_X+(IDLE_DATE_MON_EN_W-str_w)/2, IDLE_DATE_MON_EN_Y, str_mon[date_time.month-1]);
			else
				LCD_ShowUniStr(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, str_mon[date_time.month-1]);
		}
		break;
	}
}

void IdleShowSystemTime(void)
{
	static bool flag = false;
	uint32_t img_num[10] = {IMG_ID_FONT_129_NUM_0,IMG_ID_FONT_129_NUM_1,IMG_ID_FONT_129_NUM_2,IMG_ID_FONT_129_NUM_3,IMG_ID_FONT_129_NUM_4,
							IMG_ID_FONT_129_NUM_5,IMG_ID_FONT_129_NUM_6,IMG_ID_FONT_129_NUM_7,IMG_ID_FONT_129_NUM_8,IMG_ID_FONT_129_NUM_9};

