duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
		LCD_ShowImage(SYNC_ICON_X, SYNC_ICON_Y, IMG_ID_SYNC_SUCCESS);
		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
		
	case SYNC_STATUS_FAIL:
	#ifdef CONFIG_ANIMATION_SUPPORT 
		AnimaStop();
	#endif
	
		LCD_ShowImage(SYNC_ICON_X, SYNC_ICON_Y, IMG_ID_SYNC_FAIL);
		SetLeftKeyUpHandler(ExitSyncDataScreen);
		break;
	}
}

void SyncShowStatus(void)
{
	LCD_Clear(BLACK);

	LCD_ShowImage(SYNC_ICON_X, SYNC_ICON_Y, IMG_ID_SYNV_READY);
	LCD_ShowImage(SYNC_RUNNING_ANI_X, SYNC_RUNNING_ANI_Y, IMG_ID_PROGRASS_ANI_0);
}

void SyncScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_SYNC].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_SYNC].status = SCREEN_STATUS_CREATED;

		SyncShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_SYNC].para&SCREEN_EVENT_UPDATE_SYNC)
			scr_msg[SCREEN_ID_SYNC].para &= (~SCREEN_EVENT_UPDATE_SYNC);

		SyncUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_SYNC].act = SCREEN_ACTION_NO;
}
#endif/*CONFIG_SYNC_SUPPORT*/

#ifdef CONFIG_ECG_SUPPORT
void EcgUpdateStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t tmpbuf[128] = {0};
	uint8_t strbuf[64] = {0};

	/*update ecg status*/	
}

void EcgShowStatus(void)
{
	uint16_t i,x,y,w,h;
	uint8_t tmpbuf[128] = {0};

  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);
  #else	
	LCD_SetFontSize(FONT_SIZE_24);
  #endif

	mmi_asc_to_ucs2(tmpbuf, "");
	LCD_MeasureUniString(tmpbuf, &w, &h);
#ifdef LANGUAGE_AR_ENABLE	
	if(g_language_r2l)
		LCD_ShowUniStringRtoL(BP_NOTIFY_X+(BP_NOTIFY_W+w)/2, BP_NOTIFY_Y, tmpbuf);
	else
#endif		
		LCD_ShowUniString(BP_NOTIFY_X+(BP_NOTIFY_W-w)/2, BP_NOTIFY_Y, tmpbuf);

}

// ECG波形显示区域定义
#define ECG_WAVE_X_START    GRID_X_START        // 波形起始X与网格左边界对齐
#define ECG_WAVE_X_END      (LCD_WIDTH - 15)
#define ECG_WAVE_Y_START    75                  // 波形区域与网格顶部对齐
#define ECG_WAVE_HEIGHT     285                 // 波形区域高度与网格一致
#define ECG_WAVE_COLOR      RED
#define GRID_SMALL_COLOR    GRAY
#define SMALL_GRID_SIZE     13                  // 小网格尺寸（格子内宽）
#define GRID_LINE_WIDTH     2                   // 网格线宽度

// 屏幕尺寸：宽390 x 高450
// 顶部预留15%空间：450 * 0.15 = 67.5 ≈ 68像素，取整后75像素
// 底部预留20%空间：450 * 0.2 = 90像素
// 网格可用高度：450 - 75 - 90 = 285像素
// Y方向：19个格子，每个格子13像素 + 20条线各2像素 = 247 + 40 = 287 ≈ 285
// X方向：24个格子，每个格子13像素 + 25条线各2像素 = 312 + 50 = 362 ≈ 360
#define GRID_CELLS_Y        19                  // Y方向19个格子
#define GRID_CELLS_X        24                  // X方向24个格子
#define GRID_PIXEL_HEIGHT   (GRID_CELLS_Y * SMALL_GRID_SIZE + (GRID_CELLS_Y + 1) * GRID_LINE_WIDTH)  // 287
#define GRID_PIXEL_WIDTH    (GRID_CELLS_X * SMALL_GRID_SIZE + (GRID_CELLS_X + 1) * GRID_LINE_WIDTH)  // 362
// 网格起始位置
#define GRID_Y_START        75                  // 顶部预留75像素
#define GRID_X_START        14                  // 左右边距14像素，使网格居中
// 网格结束位置
#define GRID_Y_END          (GRID_Y_START + GRID_PIXEL_HEIGHT - 1)  // 361
#define GRID_X_END          (GRID_X_START + GRID_PIXEL_WIDTH - 1)    // 375

// ECG数据环形缓冲区
#define ECG_LOCAL_BUFFER_SIZE  512
static int16_t ecg_local_buffer[ECG_LOCAL_BUFFER_SIZE];
static volatile uint16_t ecg_local_read_idx = 0;
static volatile uint16_t ecg_local_write_idx = 0;
static volatile bool ecg_local_buffer_full = false;

// 波形绘制状态
static uint16_t s_ecg_wave_x = ECG_WAVE_X_START;
static uint16_t s_ecg_prev_y = ECG_WAVE_Y_START + ECG_WAVE_HEIGHT / 2;
static uint16_t s_ecg_prev_x = ECG_WAVE_X_START;

// 网格列模板预计算
// 周期 = SMALL_GRID_SIZE + GRID_LINE_WIDTH = 13 + 2 = 15
#define ECG_GRID_STRIPE_PERIOD  (SMALL_GRID_SIZE + GRID_LINE_WIDTH)  // 15
// 每列模板高度多1行，防止LCD_DrawLine斜线在GRID_Y_END+1处残留
#define ECG_GRID_COL_HEIGHT     (GRID_PIXEL_HEIGHT + 1)              // 288
// 每个模板 1 列 * ECG_GRID_COL_HEIGHT * 2 字节
static uint8_t ecg_col_templates[ECG_GRID_STRIPE_PERIOD][ECG_GRID_COL_HEIGHT * 2];
static bool ecg_col_templates_ready = false;

// 在 EcgDisplayInit 时调用，预计算所有 15 种列模板
static void EcgPrecomputeColTemplates(void)
{
    const uint16_t GRAY_H  = GRID_SMALL_COLOR >> 8;
    const uint16_t GRAY_L  = GRID_SMALL_COLOR & 0xFF;
    const uint16_t BLACK_H = BLACK >> 8;
    const uint16_t BLACK_L = BLACK & 0xFF;

    for (uint16_t xp = 0; xp < ECG_GRID_STRIPE_PERIOD; xp++) {
        bool is_vcol = (xp < GRID_LINE_WIDTH);  // 该列是否为竖线
        uint8_t *tmpl = ecg_col_templates[xp];
        uint32_t idx = 0;

        for (uint16_t y = 0; y < ECG_GRID_COL_HEIGHT; y++) {
            uint16_t color_h, color_l;
            if (y < GRID_PIXEL_HEIGHT) {
                // 在网格有效高度内
                uint16_t yp = y % ECG_GRID_STRIPE_PERIOD;
                bool is_hrow = (yp < GRID_LINE_WIDTH);  // 该行是否为横线
                if (is_vcol || is_hrow) {
                    color_h = GRAY_H;
                    color_l = GRAY_L;
                } else {
                    color_h = BLACK_H;
                    color_l = BLACK_L;
                }
            } else {
                // 超出网格底部的1行：黑色（覆盖斜线残留）
                color_h = BLACK_H;
                color_l = BLACK_L;
            }
            tmpl[idx++] = color_h;
            tmpl[idx++] = color_l;
        }
    }
    ecg_col_templates_ready = true;
}

// 快速恢复指定列的网格（清除旧波形，恢复网格背景）
// 固定恢复宽度为 2 列，直接拼接两个预计算模板，一次 SPI 刷新
#define ECG_RESTORE_COL_WIDTH  2
static void RestoreGridColumns(uint16_t x, uint16_t width)
{
    (void)width;  // 固定宽度 2，忽略参数

    if (!ecg_col_templates_ready) {
        return;
    }
    if (x + ECG_RESTORE_COL_WIDTH > ECG_WAVE_X_END + 1) {
        return;
    }

    // 拼合两列模板到静态发送缓冲区（交错写入：每行先col0再col1）
    static uint8_t data_buf[ECG_RESTORE_COL_WIDTH * ECG_GRID_COL_HEIGHT * 2];

    uint16_t xp0 = (x     - GRID_X_START) % ECG_GRID_STRIPE_PERIOD;
    uint16_t xp1 = (x + 1 - GRID_X_START) % ECG_GRID_STRIPE_PERIOD;
    const uint8_t *t0 = ecg_col_templates[xp0];
    const uint8_t *t1 = ecg_col_templates[xp1];

    // LCD 行优先扫描：每行依次存 col0、col1
    uint32_t src = 0, dst = 0;
    for (uint16_t y = 0; y < ECG_GRID_COL_HEIGHT; y++) {
        data_buf[dst++] = t0[src];
        data_buf[dst++] = t0[src + 1];
        data_buf[dst++] = t1[src];
        data_buf[dst++] = t1[src + 1];
        src += 2;
    }

    BlockWrite(x, GRID_Y_START, ECG_RESTORE_COL_WIDTH, ECG_GRID_COL_HEIGHT);
    DispData(ECG_RESTORE_COL_WIDTH * ECG_GRID_COL_HEIGHT * 2, data_buf);
}

// 动态显示 ECG 波形（不清屏，只恢复当前列网格）
static void DisplayDynamicECGPoint(int16_t value)
{
    // Y 轴映射 - 使用宏定义的网格区域

