duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
    // Y 轴范围
    static int16_t min_value = -5000, max_value = 5000;
    if (value < min_value) value = min_value;
    if (value > max_value) value = max_value;

    int range = max_value - min_value;
    if (range == 0) range = 1;

    uint16_t y = GRID_Y_START + GRID_PIXEL_HEIGHT - 
                 (uint16_t)(((int32_t)(value - min_value) * GRID_PIXEL_HEIGHT) / range);
    
    // 限制 Y 坐标在显示区间内
    if (y < GRID_Y_START) y = GRID_Y_START;
    if (y > GRID_Y_END) y = GRID_Y_END;

    /* 加锁：保证整个"清除旧点+画新点"是原子操作，不被主线程插入 */
     LCD_Lock();  /* 需要LCD驱动层提供互斥接口时启用 */
    
    // 若到达右边界 → 重新从左边开始（不清屏）
    if (s_ecg_wave_x > GRID_X_END) {
        // 清除最右边可能残留的波形
        RestoreGridColumns(GRID_X_END - 1, 2);
        
        s_ecg_wave_x = GRID_X_START;
        s_ecg_prev_x = s_ecg_wave_x;
        s_ecg_prev_y = (GRID_Y_START + GRID_Y_END) / 2;
    } else {
        // 先清除并恢复网格背景（只恢复当前列）
        RestoreGridColumns(s_ecg_wave_x, 2);
    }

    // 设置画笔颜色为红色并画线
    POINT_COLOR = ECG_WAVE_COLOR;
    LCD_DrawLine(s_ecg_prev_x, s_ecg_prev_y, s_ecg_wave_x, y);

    LCD_Unlock();

    // 更新位置
    s_ecg_prev_x = s_ecg_wave_x;
    s_ecg_prev_y = y;
    s_ecg_wave_x += 2;
}

// 新的ECG数据显示函数 - 接收256字节数据并绘制波形
void EcgDisplayProcessData(const uint8_t *data, uint16_t length)
{
    // 不在ECG界面时不绘制
    if (screen_id != SCREEN_ID_ECG) {
        return;
    }

    // 验证输入参数
    if (data == NULL || length != 256) {
        LOGD("Invalid ECG data: data=%p, length=%d", data, length);
        return;
    }
    
    // 256字节 = 128个int16_t，每两字节一个样本，低字节在前（Little-Endian）
    // 手动解析避免对齐问题
    for (int i = 0; i < 128; i++) {
        int16_t value = (int16_t)((uint16_t)data[i * 2] | ((uint16_t)data[i * 2 + 1] << 8));
        
        // Y 轴映射 - 使用宏定义的网格区域
        static int16_t min_value = -6000, max_value = 6000;
        if (value < min_value) value = min_value;
        if (value > max_value) value = max_value;

        int range = max_value - min_value;
        if (range == 0) range = 1;

        uint16_t y = GRID_Y_START + GRID_PIXEL_HEIGHT - 
                     (uint16_t)(((int32_t)(value - min_value) * GRID_PIXEL_HEIGHT) / range);
        
        // 限制 Y 坴标在显示区间内
        if (y < GRID_Y_START) y = GRID_Y_START;
        if (y > GRID_Y_END) y = GRID_Y_END;

        /* 加锁：保证整个"清除旧点+画新点"是原子操作 */
        //LCD_Lock();
        
        // 若到达右边界 → 重新从左边开始
        if (s_ecg_wave_x > GRID_X_END) {
            // 清除最右边可能残留的波形，从 GRID_X_END-1 开始覆盖2列
            RestoreGridColumns(GRID_X_END - 1, 2);
            
            s_ecg_wave_x = GRID_X_START;
            s_ecg_prev_x = s_ecg_wave_x;
            s_ecg_prev_y = (GRID_Y_START + GRID_Y_END) / 2;
            // 同时清除起始列，避免上一轮残留
            RestoreGridColumns(GRID_X_START, 2);
        } else {
            // 先清除并恢复网格背景（只恢复当前列）
            RestoreGridColumns(s_ecg_wave_x, 2);
        }

        // 设置画笔颜色为红色并画线
        POINT_COLOR = ECG_WAVE_COLOR;
        LCD_DrawLine(s_ecg_prev_x, s_ecg_prev_y, s_ecg_wave_x, y);

        //LCD_Unlock();

        // 更新位置
        s_ecg_prev_x = s_ecg_wave_x;
        s_ecg_prev_y = y;
        s_ecg_wave_x += 2;
    }
}

// 初始化ECG显示
void EcgDisplayInit(void)
{
    // 预计算网格列模板（仅在模板未就绪时执行，避免重复计算）
    if (!ecg_col_templates_ready) {
        EcgPrecomputeColTemplates();
    }

    // 绘制网格背景
    EcgDrawGrid();
    
    // 初始化波形绘制位置
    s_ecg_wave_x = GRID_X_START;
    s_ecg_prev_x = s_ecg_wave_x;
    s_ecg_prev_y = (GRID_Y_START + GRID_Y_END) / 2;
    
    //LOGD("ECG display initialized");
}

void EcgDisplayDeinit(void)
{
    // 恢复默认颜色，避免影响其他界面
    POINT_COLOR = WHITE;
    BACK_COLOR = BLACK;
    
    //LOGD("ECG display deinitialized");
}

void EcgDrawGrid(void)
{
    // 1. 先填充整个网格区域为黑色背景
    //LCD_FillColor(GRID_X_START, GRID_Y_START, GRID_PIXEL_WIDTH, GRID_PIXEL_HEIGHT, BLACK);
    
    // 2. 画水平网格线
    for (uint8_t row = 0; row <= GRID_CELLS_Y; row++) {
        uint16_t y = GRID_Y_START + row * (SMALL_GRID_SIZE + GRID_LINE_WIDTH);
        LCD_FillColor(GRID_X_START, y, GRID_PIXEL_WIDTH, GRID_LINE_WIDTH, GRID_SMALL_COLOR);
    }
    
    // 3. 画垂直网格线
    for (uint8_t col = 0; col <= GRID_CELLS_X; col++) {
        uint16_t x = GRID_X_START + col * (SMALL_GRID_SIZE + GRID_LINE_WIDTH);
        LCD_FillColor(x, GRID_Y_START, GRID_LINE_WIDTH, GRID_PIXEL_HEIGHT, GRID_SMALL_COLOR);
    }
}

void EcgScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_ECG].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_ECG].status = SCREEN_STATUS_CREATED;

		LCD_Clear(BLACK);
		IdleShowSignal();
		IdleShowNetMode();
		IdleShowBatSoc();
		EcgShowStatus();
		// 初始化ECG显示
		EcgDisplayInit();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_SIG)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_SIG);
			IdleShowSignal();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_NET_MODE)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_NET_MODE);	
			IdleShowNetMode();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_BAT)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_BAT);
			IdleUpdateBatSoc();
		}
		if(scr_msg[SCREEN_ID_ECG].para&SCREEN_EVENT_UPDATE_BP)
		{
			scr_msg[SCREEN_ID_ECG].para &= (~SCREEN_EVENT_UPDATE_BP);
			EcgUpdateStatus();
		}
		break;
	}
	
	scr_msg[SCREEN_ID_ECG].act = SCREEN_ACTION_NO;
}

static void EcgStartTimerOutCallBack(struct k_timer *timer_id)
{
	MenuStartECG();
}
void ExitEcgScreen(void)
{
	LOGD("Exit ECG screen");
	// 停止ECG启动定时器
	k_timer_stop(&ecg_start_timer);

	// 停止ECG采集
	MenuStopECG();

	// 清理ECG显示（停止画图）
	EcgDisplayDeinit();

	// 重置波形绘制状态
	s_ecg_wave_x = ECG_WAVE_X_START;
	s_ecg_prev_x = ECG_WAVE_X_START;
	s_ecg_prev_y = ECG_WAVE_Y_START + (uint16_t)(ECG_WAVE_HEIGHT * 0.5);

	ecg_local_read_idx = 0;
	ecg_local_write_idx = 0;

	LCD_Set_BL_Mode(LCD_BL_AUTO);

