duxinglang-1/nRF9151_test/N2_NCS2.7.0_TEST/src/screen/screen.c
void ExitDlPpgScreen(void)
{
	EnterPoweroffScreen();
}
#endif


void EnterDlScreen(void)
{
#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStop();
#endif
#ifdef CONFIG_TEMP_SUPPORT
	if(TempIsWorking())
		MenuStopTemp();
#endif

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_DL;	
	scr_msg[SCREEN_ID_DL].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_DL].status = SCREEN_STATUS_CREATING;

	k_timer_stop(&mainmenu_timer);
}
#endif/*CONFIG_DATA_DOWNLOAD_SUPPORT*/

#ifdef CONFIG_FOTA_DOWNLOAD
void VerCheckShowStatus(void)
{
	uint16_t x,y,w,h;
	uint16_t tmpbuf[128] = {0};
	uint16_t str_notify[LANGUAGE_MAX][49] = {
											#ifndef FW_FOR_CN
												{0x0043,0x0068,0x0065,0x0063,0x006B,0x0069,0x006E,0x0067,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0020,0x0069,0x006E,0x0066,0x006F,0x0072,0x006D,0x0061,0x0074,0x0069,0x006F,0x006E,0x0000},//Checking version information
												{0x00DC,0x0062,0x0065,0x0072,0x0070,0x0072,0x00FC,0x0066,0x0065,0x0020,0x0056,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0073,0x0069,0x006E,0x0066,0x006F,0x0072,0x006D,0x0061,0x0074,0x0069,0x006F,0x006E,0x0065,0x006E,0x0000},//?berprüfe Versionsinformationen
												{0x0056,0x00E9,0x0072,0x0069,0x0066,0x0069,0x0065,0x007A,0x0020,0x006C,0x0065,0x0073,0x0020,0x0069,0x006E,0x0066,0x006F,0x0072,0x006D,0x0061,0x0074,0x0069,0x006F,0x006E,0x0073,0x0020,0x0064,0x0065,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0000},//Vérifiez les informations de version
												{0x0043,0x006F,0x006E,0x0074,0x0072,0x006F,0x006C,0x006C,0x006F,0x0020,0x006C,0x0065,0x0020,0x0069,0x006E,0x0066,0x006F,0x0072,0x006D,0x0061,0x007A,0x0069,0x006F,0x006E,0x0069,0x0020,0x0073,0x0075,0x006C,0x006C,0x0061,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0065,0x0000},//Controllo le informazioni sulla versione
												{0x0053,0x0065,0x0020,0x0065,0x0073,0x0074,0x00E1,0x0020,0x0072,0x0065,0x0076,0x0069,0x0073,0x0061,0x006E,0x0064,0x006F,0x0020,0x006C,0x0061,0x0020,0x0069,0x006E,0x0066,0x006F,0x0072,0x006D,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0064,0x0065,0x0020,0x006C,0x0061,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x00F3,0x006E,0x0000},//Se está revisando la información de la versión
												{0x0041,0x0020,0x0076,0x0065,0x0072,0x0069,0x0066,0x0069,0x0063,0x0061,0x0072,0x0020,0x0061,0x0073,0x0020,0x0069,0x006E,0x0066,0x006F,0x0072,0x006D,0x0061,0x00E7,0x00F5,0x0065,0x0073,0x0020,0x0064,0x0061,0x0020,0x0076,0x0065,0x0072,0x0073,0x00E3,0x006F,0x0000},//A verificar as informa??es da vers?o
											#else
												{0x6B63,0x5728,0x68C0,0x67E5,0x7248,0x672C,0x4FE1,0x606F,0x0000},//正在检查版本信息
												{0x0043,0x0068,0x0065,0x0063,0x006B,0x0069,0x006E,0x0067,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0020,0x0069,0x006E,0x0066,0x006F,0x0072,0x006D,0x0061,0x0074,0x0069,0x006F,0x006E,0x0000},//Checking version information
											#endif
											};

	LCD_Clear(BLACK);
	LCD_SetFontBgColor(BLACK);
	
	mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
	LCD_MeasureUniString(tmpbuf, &w, &h);
	LCD_ShowUniString((LCD_WIDTH-w)/2, (LCD_HEIGHT-h)/2, tmpbuf);

	ClearAllKeyHandler();
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif
}

void VerCheckUpdateStatus(void)
{
}

void VerCheckScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_VER_CHECK].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_VER_CHECK].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_VER_CHECK].status = SCREEN_STATUS_CREATED;

		VerCheckShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_VER_CHECK].para&SCREEN_EVENT_UPDATE_FOTA)
		{
			scr_msg[SCREEN_ID_VER_CHECK].para &= (~SCREEN_EVENT_UPDATE_FOTA);
			VerCheckUpdateStatus();
		}

		if(scr_msg[SCREEN_ID_VER_CHECK].para == SCREEN_EVENT_UPDATE_NO)
			scr_msg[SCREEN_ID_VER_CHECK].act = SCREEN_ACTION_NO;
		break;
	}
}

void EnterVerCheckScreen(void)
{
	if(screen_id == SCREEN_ID_VER_CHECK)
		return;
	
	k_timer_stop(&mainmenu_timer);

#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStop();
#endif
#ifdef CONFIG_TEMP_SUPPORT
	if(TempIsWorking())
		MenuStopTemp();
#endif

	LCD_Set_BL_Mode(LCD_BL_ALWAYS_ON);

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_VER_CHECK;	
	scr_msg[SCREEN_ID_VER_CHECK].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_VER_CHECK].status = SCREEN_STATUS_CREATING;

	VerCheckStart();
}

void FOTAShowStatus(void)
{
	LCD_Clear(BLACK);
#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else	
	LCD_SetFontSize(FONT_SIZE_16);
#endif
	
	LCD_ShowImg_From_Flash(FOTA_LOGO_X, FOTA_LOGO_Y, IMG_OTA_LOGO_ADDR);
	LCD_ShowImg_From_Flash(FOTA_YES_X, FOTA_YES_Y, IMG_OTA_YES_ADDR);
	LCD_ShowImg_From_Flash(FOTA_NO_X, FOTA_NO_Y, IMG_OTA_NO_ADDR);

#ifdef FONTMAKER_UNICODE_FONT
  #ifdef LANGUAGE_AR_ENABLE
	if(g_language_r2l)
		LCD_AdaptShowUniStrRtoLInRect(FOTA_START_STR_X+FOTA_START_STR_W, FOTA_START_STR_Y, FOTA_START_STR_W, FOTA_START_STR_H, STR_ID_FW_UPGRADE_REQUEST, SHOW_ALIGN_CENTER, SHOW_ALIGN_CENTER);
	else
  #endif		
		LCD_AdaptShowUniStrInRect(FOTA_START_STR_X, FOTA_START_STR_Y, FOTA_START_STR_W, FOTA_START_STR_H, STR_ID_FW_UPGRADE_REQUEST, SHOW_ALIGN_CENTER, SHOW_ALIGN_CENTER);
#endif

	SetRightKeyUpHandler(fota_excu);
	SetLeftKeyUpHandler(fota_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_YES_X-30, FOTA_YES_X+FOTA_YES_W+30, FOTA_YES_Y-30, FOTA_YES_Y+FOTA_YES_H+30, fota_excu);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NO_X-30, FOTA_NO_X+FOTA_NO_W+30, FOTA_NO_Y-30, FOTA_NO_Y+FOTA_NO_H+30, fota_exit);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_exit);	
#endif
}

void FOTAUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	uint16_t tmpbuf[128] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif	
	switch(get_fota_status())
	{
	case FOTA_STATUS_PREPARE:
		flag = false;
		break;
		
	case FOTA_STATUS_LINKING:
		{
			LCD_Fill(0, FOTA_YES_Y, LCD_WIDTH, FOTA_YES_H, BLACK);
			LCD_Fill(0, FOTA_START_STR_Y, LCD_WIDTH, FOTA_START_STR_H, BLACK);

		#ifdef FONTMAKER_UNICODE_FONT
			LCD_MeasureUniStr(STR_ID_FW_LINKING_TO_SERVER, &w, &h);
		  #ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
			{
				x = w > FOTA_START_STR_W ? (FOTA_START_STR_X+FOTA_START_STR_W) : (LCD_WIDTH+w)/2;
				LCD_ShowUniStrRtoL(x, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, STR_ID_FW_LINKING_TO_SERVER);
			}
			else
		  #endif
			{
				x = w > FOTA_START_STR_W ? FOTA_START_STR_X : (LCD_WIDTH-w)/2;
				LCD_ShowUniStr(x, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, STR_ID_FW_LINKING_TO_SERVER);
		  	}
		#endif

			ClearAllKeyHandler();
		}
		break;
		
